import random

answer = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да","Можешь быть уверен в этом", 
"Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да",
"Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать",
"Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет",
"Перспективы не очень хорошие", "Весьма сомнительно"]
question_word = ["кто", "что", "какой", "который", "где", "когда", "почему", "зачем", "куда", "откуда", 
"сколько", "чей", "как"]

name = input('Как тебя зовут? ')
print(f'Привет, {name}! Я магический шар, способный угадать твою судьбу!')

def valid_question(question):
    q_split = question.split()
    if q_split[0].lower() in question_word:
        return False
    return True

def answer_q(question):
    flag_question = True
    while flag_question == True:
        if valid_question(question) and question[-1] == '?':
            print(random.choice(answer))
            flag_question = False
            if input('Ещё раз?(да/нет): ').lower() == 'да':
                start()
        elif not valid_question(question):
            print('Введите вопрос соответствующий ответу да или нет!')
            question = input('Введите интересующий вопрос: ')
        else:
            print('Только вопрос, никаких утверждений!')
            question = input('Введите интересующий вопрос: ')

def start():
    print('Следуй следующим инструкциям, чтобы получить ответ на твой вопрос:')
    print('1. вопросы должны соответствовать ответам да или нет;')
    print('2. используй знак вопроса заканчивая свой вопрос;')
    print('3. будь готов узнать настоящую правду!')
    print('Поехали!')
    answer_q(input('Введите интересующий вопрос: '))

start()

print('Спасибо за игру, возвращайся!')
